Revit 2026 API

# FamilyInstanceGetSweptProfile Method

---

Gets the object that describes the profile that is swept along the driving curve for this instance.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public SweptProfile GetSweptProfile()
```
```vb
Public Function GetSweptProfile As SweptProfile
```
```cpp
public:
SweptProfile^ GetSweptProfile()
```
```fsharp
member GetSweptProfile : unit -> SweptProfile
```

#### Return Value

SweptProfileA swept profile.

| Exception | Condition |
| --- | --- |
| InapplicableDataException | Thrown if this instance does not have a swept profile. |

#### Reference

FamilyInstance Class

Autodesk.Revit.DB Namespace